## Plan for scanners/github
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 9 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "CloudWatchAccess"
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ECRImageAccess"
        }
      + statement {
          + actions   = [
              + "s3:Get*",
              + "s3:GetBucketLocation",
              + "s3:ListBucket",
              + "s3:ListBucketVersions",
              + "s3:Put*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "S3BucketAccess"
        }
    }

  # aws_ecr_repository.scanners-github will be created
  + resource "aws_ecr_repository" "scanners-github" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "scan-websites/scanners/github"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.github_scanner.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/scanners-github"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
    }

  # module.github_scanner.aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "scanners-github-0"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
    }

  # module.github_scanner.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "scanners-github"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.github_scanner.aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "scanners-github"
    }

  # module.github_scanner.aws_iam_role_policy_attachment.attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scanners-github"
    }

  # module.github_scanner.aws_iam_role_policy_attachment.lambda_insights[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "scanners-github"
    }

  # module.github_scanner.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "scanners-github"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "REPORT_DATA_BUCKET" = "scan-websites-production-github-report-data"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

  # module.github_scanner.aws_lambda_permission.sns[0] will be created
  + resource "aws_lambda_permission" "sns" {
      + action        = "lambda:InvokeFunction"
      + function_name = "scanners-github"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = "arn:aws:sns:ca-central-1:507252742351:github-urls"
      + statement_id  = "AllowExecutionFromSNS0"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.scanners-github"]

9 tests, 8 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
